{
    "primary_skills": [
        "C#",
        "TypeScript",
        "JavaScript",
        "Express.js",
        ".Net",
        "Machine Learning",
        "SQL",
        "MongoDB",
        "Python",
        "Java",
        "Git",
        "CI/CD",
        "Vue.js",
        "Linux",
        "AWS",
        "Unit Testing",
        "Kubernetes",
        "React",
        "Ruby on Rails",
        "Ruby",
        "Docker",
        "Terraform"
      ],
      "secondary_skills": [
        "Analysis",
        "Time Management",
        "Adaptive",
        "Information Dissemination",
        "Problem Solving",
        "Interaction Design",
        "Qualitative Research",
        "Agile",
        "Scrum"
      ],
    "work_experience": [
        {
          "role": "PhD Student",
          "institution": "Newcastle University",
          "from": "2017-09-01",
          "to": "2019-04-01",
          "location": "Newcastle upon Tyne, United Kingdom",
          "description":
            "My PhD thesis centred on supporting mental wellbeing in later life, through the presentation and use of media. This is approached through creating technologies using a sensitive experience-centred design approach. To realise this, I have created and deployed technological artefacts using technologies such as: 3D printing, web applications, and developing mobile applications. As such I have developed a strong skillset in frontend and backend development as well as managing a project as a whole. As part of my PhD I have worked with care homes in the UK and Ireland, became a member of the steering group of a local dementia charity, consulted with the Red Cross on their interaction design processes, collaborated across disciplines and institutions, and presented and published at prestigious conferences.",
          "sub_roles": [
            {
              "role": "Research Software Engineer",
              "institution": "Newcastle University / Northumbria University",
              "from": "2017-01-01",
              "to": "2019-04-01",
              "location": "Newcastle upon Tyne, United Kingdom",
              "description":
                "During my PhD I have consulted and freelanced as a software engineer on a number of research projects. I have developed websites, created a web application for women’s rights activists, and helped create wearable technologies that help people in later life cope with death and grief. Between my undergraduate and master’s degree I also interned at Open Lab to develop a cross-platform mobile application, encouraging conversation between younger people and people with dementia. During this project, I lead the application design and development in a co-design process with younger carers of people with dementia. I have been the technological lead on most of these projects using technologies such as: Vue.js, Wordpress, Node.js, TypeScript, Nginx, Docker, MongoDB. Examples of my work can be found in the papers cited below where I developed the technologies they’re centred on."
            }
          ]
        },
        {
          "role": "Backend Software Engineer",
          "institution": "Qred",
          "from": "2019-05-01",
          "to": "2019-08-01",
          "location": "Stockholm, Sweden",
          "description":
            "At Qred I work as a Backend Software Developer, helping to maintain and develop the company's core infrastructure. I help redesign and further develop Qred's back end to smoothly meet a rapidly growing customer base, using tools such as Java, C#, Kubernetes, and CI/CD."
        },
        {
          "role": "Fullstack Software Engineer",
          "institution": "Doctolib",
          "from": "2022-04-01",
          "location": "Berlin, Germany",
          "description":
            "As a software engineer at Doctolib, I specialize in Ruby on Rails, and React. My role involves spearheading projects focused on refactoring, maintaining, and modernizing critical components of the codebase. I actively collaborate with cross-functional teams, provide mentorship to fellow engineers, and take the lead on significant projects driving major product updates."
        },
        {
          "role": "Fullstack Consultant Software Engineer",
          "institution": "13|37",
          "from": "2019-08-01",
          "to": "2022-03-01",
          "location": "Stockholm, Sweden",
          "description":
            "I worked at 13|37 as a Consultant Fullstack Software Engineer. I consulted on varied and challenging software projects across Stockholm. I predominately worked with JavaScript, Node, Express, and React to help clients achieve their technical needs, and using other technologies as necessary. I have worked with micro-service architectures both small and large teams - using CI/CD and terraform to manage projects. I mostly worked as a technical partner with clients, helping to identify, plan, and then achieve their software development needs.",
          "sub_roles": [
            {
              "role": "Fullstack Software Engineer (Consultant)",
              "institution": "Paradox Interactive",
              "from": "2019-09-01",
              "to": "2021-09-01",
              "location": "Stockholm, Sweden",
              "description": ""
            },
            {
              "role": "Fullstack Software Engineer (Consultant)",
              "institution": "Chroma",
              "from": "2021-09-01",
              "to": "2022-02-01",
              "location": "Stockholm, Sweden",
              "description": ""
            }
          ]
        }
      ],
      "education": [
        {
          "role": "BSc Computing Science",
          "institution": "Newcastle University",
          "grade": "First Class (Hons)",
          "from": "2013-09-01",
          "to": "2016-05-01",
          "location": "Newcastle upon Tyne, United Kingdom",
          "description":
            "During my undergraduate degree, I learnt a diverse range of skills in computing science, including software design, web and app development, and human computer interaction. I used these skills to co-design a web application with older people. This system helped older people facing age related conditions share healthy recipes with other people who have similar dietary requirements. Furthermore, I learnt the fundamentals of software development practices, designing algorithms, system security, cryptography and fault tolerances."
        },
        {
          "role": "MRes Digital Civics",
          "institution": "Newcastle University",
          "grade": "Distinction",
          "from": "2016-09-01",
          "to": "2017-08-01",
          "location": "Newcastle upon Tyne, United Kingdom",
          "description":
            "This Masters focussed on developing technologies to aid social care. I conducted research into how technology can support intergenerational interactions between young people and people with dementia. As part of this I developed a mobile application called Ticket to Talk. I learnt to work closely with families and people with dementia in a user-centred design process, as well as care homes, and local charities to evaluate and improve the technology. ESRC and Newcastle University ran a full press release on the project, as well the UK’s Department for Business, Energy, and Industrial Strategy including the app in their latest industrial campaign. In I developed skills in developing ubiquitous technologies, peer programming, and mobile development."
        },
        {
          "role": "PhD Digital Civics",
          "institution": "Newcastle University",
          "grade": "Incomplete",
          "from": "2017-09-01",
          "to": "2019-05-01",
          "location": "Newcastle upon Tyne, United Kingdom",
          "description":
            "I studied at Open Lab, Newcastle University, the third largest biggest Human Computer Interaction research group. My PhD thesis centred on supporting mental wellbeing in later life, through the presentation and use of media. This was achieved through creating tech- nologies using a sensitive experience-centred design approach. To realise this, I created and deployed technologies such as: 3D printed devices, web applications, and mobile applications. I developed a strong skillset in development, research, design, independent learning, and project management. As part of my PhD I have worked with care homes in the UK and Ireland, became a member of the steering group of a local dementia charity, consulted with the Red Cross on their interaction design processes, collaborated across disciplines and institutions, and presented and published at prestigious conferences."
        }
      ]
}